const message = `


بحبك ♥️

انا مش عارف ابدا كلامي معاكي منين ولا عارف اقولك ازاي ان وجودك ف حياتي بقى من أجمل الحاجات اللي حصلتلي وهو اساسا اجمل حاجة بس اللي انا متأكد منه إن مهما كتبت ومهما قلت برضو عمري ما هعرف اوصفلك قد ايه انا بحبك والله ♥️

بحبك أوي أوي لدرجة إن كلمة بحبك نفسها بقت قليلة على اللي جوايا ناحيتك والله ♥️
حاجه كدة قريبه من عشق الجنون 😂♥️

أنا مبسوط إنك معايا و مبسوط إن ربنا جمعني بيكي ومبسوط أكتر إني بشوفك كل يوم بتكبري قدامي وبشوف فيكي حاجات تخليني أفتخر بيكي أكتر وأكتر والله 
أنا فخور بيكي و بشخصيتك و بقلبك و بطريقة تفكيرك وبكل حاجة فيكي ها كل حاجة 😂♥️♥️
 وحتى الحاجات الصغيرة اللي يمكن إنتي مش واخدة بالك منها أنا بشوفها وبحبها أوي أوي زي م بحبك ♥️♥️

إنتي مش بس خطيبتي وحبيبتي لا  إنتي الإنسانه الوحيده اللي قدرت تعوضني عن كل لحظه إن عيشتها ف حياتي والله و انتي  اللي نفسي أكمل معاها عمري كله و نفسي كل اللي بينا يبقى مجرد بداية لحياة طويلة نعيشها سوا بكل تفاصيلها الحلوة والصعبة و نفسي أصحى كل يوم وأنا عارف إنك جنبي وف حضني  وأرجع آخر اليوم ألاقيكي قدامي ونفضل نضحك ونتخانق ونصالح بعض ونكبر سوا مهو مفيش مفر ♥️

المهم نتكلم شوية عن عيد ميلادك وطبعا دا يوم ولادتي انا مش انتي عشان انتي حياتي ♥️
وانا أكتر حاجة نفسي فيها إن السنه الجايه من عمرك تكون أحلى من كل اللي فات وتيجي ان شاء الله وربنا محققلك كل حاجة نفسك فيها زي ان نكون مع بعض مثلا 😂♥️♥️ 
وربنا يكتبلك الخير والراحة والفرحة في كل خطوة ♥️

وأكتر دعوة بدعيها من قلبي إن ربنا يكرمنا ببعض ويجمعنا في بيت واحد قريب ويكتب لنا إننا نكمل حياتنا سوا على خير وتبقي مراتي وأفضل صاحبه ليا واحسن حاجة حصلتلي في الدنيا وكدة كدة احسن حاجة والله ♥️

نفسي أكون دايما الشخص اللي تلاقيه جمبك وقت حزنك قبل فرحك و تلاقيني وقت تعبك قبل نجاحك وأكون أول واحد يفرح بيكي ويفتخر بيكي واخر واحد يسيب إيدك وطبعا مش هيحصل 😂♥️

شذي يبت ي عشقي انتي ي زفته😂
 أنا يمكن مش بعرف أعبر دايما عن كل اللي جوايا ويمكن ساعات كلامي مايبقاش واحد ف الميه من اللي جوايا بس صدقيني جوايا ليكي حب كبير أوي اوي أوي  وحاجات كتير نفسي أعيشها معاكي وحاجات كتير اوي ♥️😂

عاوز أشوفك مبسوطة وعاوز أكون سبب في ابتسامتك وضحكتك وعاوز كل سنة تيجي عليكي بعد كدة وأنا جمبك وكل عيد ميلاد ليكي يكون ليا فيه ذكرى معاكي زي اني ابقا معاكي ♥️😂
لحد ما نوصل لليوم اللي نقول فيه "فاكرة أول عيد ميلاد احتفلنا بيه سوا ي روحي" ♥️

ربنا يخليكي ليا يا شذى ي حبيبتي ي عمري ي روحي ويحفظك من كل حاجة وحشة ويحققلك اللي نفسك فيه ويباركلي فيكي ويجمعنا قريب في الحلال ونبدأ أجمل فصل في حكايتنا وميكونش فيه نهايه إن شاء الله ♥️

كل سنة وإنتي حبيبتي وخطيبتي وصاحبتي وروحي وحياتي وعشقي وبنتي  وأجمل حاجة في حياتي♥️
وكل سنة وأنا بحبك أكتر من السنة اللي قبلها وأوعدك إن مهما عدا الوقت هفضل كل مرة أبصلك فيها وأقول لنفسي
"أنا فعلًا محظوظ إن شذى معايا" وأنا اساسا والله بقول ل نفسي كدة من دلوقتي انا فعلا محظوظ♥️

بحبك يا شذى حب ميتوصفش وأكبر من إني أعرف أوصفه والله ♥️
وإن شاء الله عيد ميلادك الجاي يكون وإنتي مراتي وأنا جمبك وبنحتفل سوا بالحياة اللي نفسنا فيها ♥️ قولي يااااااارب

كل سنة وإنتي أجمل نصيب ربنا اختارهولي ♥️

"واللي جاي أحلى ... ولسه قصتنا في أولها ♥️"
 
    `;

const words = message.trim().split(/\s+/);

let index = 0;
const typingText = document.getElementById("typingText");
const nextBtn = document.getElementById("nextBtn");

function typeWord() {

    if (index < words.length) {

        typingText.innerHTML += words[index] + " ";

        index++;

        setTimeout(typeWord, 200);

    } else {

        nextBtn.style.display = "inline-block";

    }
}

window.onload = typeWord;


function goNext() {
    window.location.href = "counter.html";
} 